src/cf/Documents/ИндивидуальныйПланРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ИндивидуальныйПланРазвития</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыполнениеЗаданийИПР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланГрафик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаданиеИПР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиИПР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадачИПР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановоеВремя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеВремя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ВыполнениеЗаданийИПР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеЗаданийИПР</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПометкаОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиИПР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыЗадачИПР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗадачИПР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПриступалКИзучению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалИзучать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изучил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоплюВопросыКВстрече</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланировалВстречу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВстречаПроведена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПриступалКЗаданию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриступилКВвыполнениюЗадания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаданиеВыполненоНеудовлетворительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаданиеВыполненоУдовлетворительно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ИндивидуальныйПланРазвития/Ext/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИндивидуальныйПланРазвитияПланГрафик.ЗаданиеИПР КАК ЗаданиеИПР,
		|	ИндивидуальныйПланРазвитияПланГрафик.Статус КАК Статус,
		|	ИндивидуальныйПланРазвитияПланГрафик.ДатаНачала КАК ДатаНачала,
		|	ИндивидуальныйПланРазвитияПланГрафик.ПлановоеВремя КАК ПлановоеВремя,
		|	ИндивидуальныйПланРазвитияПланГрафик.ФактическоеВремя КАК ФактическоеВремя,
		|	ИндивидуальныйПланРазвитияПланГрафик.Комментарий КАК Комментарий,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Сотрудник КАК Сотрудник,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.ДатаНачала КАК ДатаНачала1,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.ДатаОкончания КАК ДатаОкончания,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Наставник КАК Наставник,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Должность КАК Должность,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Дата КАК Дата,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИндивидуальныйПланРазвития.ПланГрафик КАК ИндивидуальныйПланРазвитияПланГрафик
		|ГДЕ
		|	НЕ ИндивидуальныйПланРазвитияПланГрафик.Статус В (&Статус)
		|	И ИндивидуальныйПланРазвитияПланГрафик.Ссылка = &Ссылка";
	
	СтатусыКИсключению = Новый Массив; 
	СтатусыКИсключению.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоНеудовлетворительно"));
	СтатусыКИсключению.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоУдовлетворительно"));
	Запрос.УстановитьПараметр("Ссылка", ОбъектКопирования.Ссылка);
	Запрос.УстановитьПараметр("Статус", СтатусыКИсключению);

	ОбъектКопирования = Неопределено;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ВыборкаДетальныеЗаписи); 
		ЭтотОбъект.Дата = Неопределено; 
		ЭтотОбъект.ДатаОкончания = Неопределено; 
		ЭтотОбъект.ДатаНачала = ТекущаяДата();
        ЭтотОбъект.ПланГрафик.Очистить();
		
		ВыборкаДетальныеЗаписи.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтрока = ЭтотОбъект.ПланГрафик.Добавить();
		    ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
    Движения.ВыполнениеЗаданийИПР.Очистить();
	Движения.ВыполнениеЗаданийИПР.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Сотрудник КАК Сотрудник,
		|	ИндивидуальныйПланРазвитияПланГрафик.ЗаданиеИПР КАК ЗаданиеИПР,
		|	ИндивидуальныйПланРазвитияПланГрафик.ФактическоеВремя КАК ФактическоеВремя
		|ИЗ
		|	Документ.ИндивидуальныйПланРазвития.ПланГрафик КАК ИндивидуальныйПланРазвитияПланГрафик
		|ГДЕ
		|	НЕ ИндивидуальныйПланРазвитияПланГрафик.Статус В (&Статус)
		|	И ИндивидуальныйПланРазвитияПланГрафик.Ссылка = &Ссылка";

	СтатусыКИсключению = Новый Массив; 
	СтатусыКИсключению.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоНеудовлетворительно"));
	СтатусыКИсключению.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоУдовлетворительно"));
	Запрос.УстановитьПараметр("Статус", СтатусыКИсключению);   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВыполнениеЗаданийИПР.Добавить();
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник; 
		Движение.Задание = ВыборкаДетальныеЗаписи.ЗаданиеИПР;
		Движение.Время = ВыборкаДетальныеЗаписи.ФактическоеВремя;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИндивидуальныйПланРазвитияПланГрафик.ЗаданиеИПР) КАК ЗаданиеИПРРазные,
		|	КОЛИЧЕСТВО(ИндивидуальныйПланРазвитияПланГрафик.ЗаданиеИПР) КАК ЗаданиеИПРВсего,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИндивидуальныйПланРазвития.ПланГрафик КАК ИндивидуальныйПланРазвитияПланГрафик
		|ГДЕ
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.ЗаданиеИПРРазные <> ВыборкаДетальныеЗаписи.ЗаданиеИПРВсего Тогда  
			Отказ = Истина;
			Сообщить("Задания в документе не должны дублироваться");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
